---
title: ExternalDataTypeUpdatedDataSourceIntoDocumentEventArgs
classe: Autodesk.Revit.DB.Events.ExternalDataTypeUpdatedDataSourceIntoDocumentEventArgs
namespace: Autodesk.Revit.DB.Events
eredita: Autodesk.Revit.DB.Events.RevitAPIPostDocEventArgs
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 3
---

# ExternalDataTypeUpdatedDataSourceIntoDocumentEventArgs

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String ItemId { get; }` | `externalDataTypeUpdatedDataSourceIntoDocumentEventArgs.ItemId` | String |
| `String ProjectId { get; }` | `externalDataTypeUpdatedDataSourceIntoDocumentEventArgs.ProjectId` | String |
| `ElementId TypeId { get; }` | `externalDataTypeUpdatedDataSourceIntoDocumentEventArgs.TypeId` | ElementId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```